app/views/users/show.html.erb


	<% @user.boards.each do |board| %>
---
SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = ?  [["user_id", 1]]

	<div class="row grid">
	<% @user.interests.each do |interest| %>
---
SELECT "interests".* FROM "interests" WHERE "interests"."user_id" = ?  [["user_id", 3]]