app/views/interests/_form.html.erb

SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = ?  [["user_id", 1]]
SELECT  1 AS one FROM "boards" WHERE "boards"."user_id" = ? LIMIT ?  [["user_id", 6], ["LIMIT", 1]]
---
    <%= f.label :board %>
    <%= f.select :board_id, options_from_collection_for_select(current_user.boards, "id", "title", "description"), class: 'form-control' %>
  </div>
    <% if !current_user.boards.any? %>