app/views/interests/show.html.erb

    <h2>Notes and Comments</h2>
    <% @interest.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."interest_id" = ?  [["interest_id", 10]]