app/views/boards/index.html.erb

		<p><%= board.description %></p>
		<p>Includes <%= board.interests.count %> interests</p>
---
SELECT COUNT(*) FROM "interests" WHERE "interests"."board_id" = ?  [["board_id", 1]]