app/views/boards/show.html.erb

SELECT "interests".* FROM "interests" WHERE "interests"."board_id" = ?  [["board_id", 1]]
---
<div class="grid row">
  <% @board.interests.each do |interest| %>