app/controllers/boards_controller.rb

SELECT "boards".* FROM "boards"
---
  def index
    @boards = Board.all

INSERT INTO "boards" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Costs"], ["description", "Media and impactful resources in propaganda"], ["user_id", 1], ["created_at", 2017-03-09 00:33:08 UTC], ["updated_at", 2017-03-09 00:33:08 UTC]]
---
  def create
    @board = current_user.boards.build(board_params)

    respond_to do |format|
      if @board.save

DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 3]]
---
  def destroy
    @board.destroy

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_board
      @board = Board.find(params[:id])