app/controllers/comments_controller.rb

SELECT  "interests".* FROM "interests" WHERE "interests"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("interest_id", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["interest_id", 10], ["body", "hello"], ["user_id", 1], ["created_at", 2017-03-14 21:22:58 UTC], ["updated_at", 2017-03-14 21:22:58 UTC]]
---
  def create
  	@interest = Interest.find(params[:interest_id])
  	cparams = comment_params
  	cparams["user_id"] = current_user.id
  	@comment = @interest.comments.create!(cparams)