app/controllers/interests_controller.rb

  def index
    @interests = Interest.all
---
SELECT "interests".* FROM "interests"

  def destroy
     @interest.destroy
---
DELETE FROM "interests" WHERE "interests"."id" = ?  [["id", 10]]

  def create
    @interest = current_user.interests.build(interest_params)
    respond_to do |format|
      if @interest.save
---
INSERT INTO "interests" ("name", "description", "user_id", "board_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "links"], ["description", "https://www.youtube.com/watch?v=qVsXl_qcv-E"], ["user_id", 1], ["board_id", 1], ["created_at", 2017-03-16 19:27:18 UTC], ["updated_at", 2017-03-16 19:27:18 UTC]]

   def set_interest
    @interest = Interest.find(params[:id])
---
SELECT  "interests".* FROM "interests" WHERE "interests"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]