app/controllers/users_controller.rb

  def show
  	 @user = User.find_by email: params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]